# VelocityPressure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryConnectorData..::..VelocityPressure Property
PipeFittingAndAccessoryConnectorData Class See Also
---
The connector velocity pressure. Units: (kg/(ft·s²)).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double VelocityPressure { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VelocityPressure As Double
	Get
```

Visual C++
---
```text
public:
property double VelocityPressure {
	double get ();
}
```

# See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace